[
  {
    "uid": "lT5Sqv2kR",
    "string": "**Indian Land Border:** #linkedBlock\nWatch {video:IwIGTOmTniQ:0}\n\nIndia shared land border **with 7 countries**:\nBangladesh > China > Pakistan > Nepal > Myanmar > Bhutan > Afghanistan\n--\nBangladesh shares the longest border with India.\nAfghanistan shares the smallest.\n![](https://firebasestorage.googleapis.com/v0/b/firescript-577a2.appspot.com/o/imgs%2Fapp%2Froamprep%2FtCOgD_esqC.png?alt=media&token=ed917f5e-fdaf-4a9a-8c36-0c93f171980a)\n"
  },
  {
    "uid": "j-kcJtxJ_",
    "string": "Important Movements: #linkedBlock\n\n**Bishnoi Movement:**\n▪️ Founded in the 15th century by Guru Maharaj Jambaji in Rajasthan.\n▪️ Known for nature reverence; protested tree felling in the 17th century.\n▪️ Over 360 Bishnois, including Amrita Devi, died protecting trees.\n\n**Chipko Movement:**\n▪️ It was about plant conservation\n▪️ Emerged in the 1970s in Uttarakhand.\nLocals, especially women, hugged trees to stop logging.\n▪️ Gained international recognition for non-violent forest conservation.\n\n\n**Appiko Movement:**\n▪️ Started in 1983 in Karnataka, inspired by Chipko.\n\"Appiko\" means \"to embrace\" in Kannada; focused on hugging trees.\n▪️ Halted tree felling in Kalse forests.\n\n\n**Silent Valley Movement:**\n▪️  In the 1970s in Kerala to protect Silent Valley rainforest.\n▪️ Prevented a hydroelectric dam, preserving the ecosystem.\n\n**Narmada Bachao Andolan (NBA):**\n▪️ Began in the 1980s, led by Medha Patkar.\n▪️ Opposed large dams on the Narmada River.\n▪️ Highlighted displacement and environmental damage from development projects."
  },
  {
    "uid": "jqTwm6hzr",
    "string": "The **atomic number** is the number of protons in an atom's nucleus, while the **atomic mass** (also called mass number) is the total number of protons and neutrons in the nucleus. \n\nThe atomic number defines the element, while the atomic mass can vary for isotopes of the same element.\n\n**Isotopes:**\nAtoms of the same element with the same number of protons but different numbers of neutrons.\nExample: Carbon-12 (¹²C) and Carbon-14 (¹⁴C).\nBoth have 6 protons (same element: Carbon).\nCarbon-12 has 6 neutrons, Carbon-14 has 8 neutrons.\n\n\n**Isobars:**\nAtoms of different elements with the same mass number but different numbers of protons and neutrons.\nExample: Carbon-14 (¹⁴C) and Nitrogen-14 (¹⁴N).\nBoth have a mass number of 14 (protons + neutrons).\nCarbon-14: 6 protons, 8 neutrons; Nitrogen-14: 7 protons, 7 neutrons. \n#linkedBlock"
  },
  {
    "uid": "c-P-hCWfk",
    "string": "▪️ The Keibul Lamjao National Park in Manipur, India, is the world's only floating national park. It is situated on Loktak Lake. \n▪️ The Floating Post Office is located on Dal Lake in Srinagar, India. \n▪️ Russia has a floating nuclear power plant called the Akademik Lomonosov.  #linkedBlock"
  },
  {
    "uid": "r3XQv80jV",
    "string": "**Important International Organizations:**\n\n**G20:**\n▪️ Full Form: Group of Twenty.\n▪️ Established: 1999.\n▪️ Members: 20 (19 countries + European Union).\n▪️ Headquarters: No permanent headquarters; secretariat rotates among member countries.\n\n\n**G7:**\n▪️ Full Form: Group of Seven.\n▪️ Established: 1975.\n▪️ Members (7): Canada, France, Germany, Italy, Japan, UK, USA.\n▪️ Headquarters: No permanent headquarters; meetings hosted by member countries on a rotating basis.\n\n\n**SAARC:**\n▪️ Full Form: South Asian Association for Regional Cooperation.\n▪️ Established: 1985.\n▪️ Members (8): Afghanistan, Bangladesh, Bhutan, India, Maldives, Nepal, Pakistan, Sri Lanka.\n▪️ Headquarters: Kathmandu, Nepal.\n\n\n**ASEAN:**\n▪️ Full Form: Association of Southeast Asian Nations.\n▪️ Established: 1967.\n▪️ Members (10): Brunei, Cambodia, Indonesia, Laos, Malaysia, Myanmar, Philippines, Singapore, Thailand, Vietnam.\n▪️ Headquarters: Jakarta, Indonesia.\n\n\n**BIMSTEC:**\n▪️ Full Form: Bay of Bengal Initiative for Multi-Sectoral Technical and Economic Cooperation.\n▪️ Established: 1997.\n▪️ Members (7): Bangladesh, Bhutan, India, Myanmar, Nepal, Sri Lanka, Thailand.\n▪️ Headquarters: Dhaka, Bangladesh.\n\n\n**ADB:**\n▪️ Full Form: Asian Development Bank.\n▪️ Established: 1966.\n▪️ Members: 68 (49 regional, 19 non-regional).\n▪️ Headquarters: Manila, Philippines.\n\n\n**IMF:**\n▪️ Full Form: International Monetary Fund.\n▪️ Established: 1945.\n▪️ Members: 190.\n▪️ Headquarters: Washington, D.C., USA.\n▪️  IMF and World Bank are together called as \"twin institutes\"\n\n**World Bank:**\n▪️ Full Form: World Bank Group.\n▪️ Established: 1944.\n▪️ Members: 189.\n▪️ Headquarters: Washington, D.C., USA. \n#linkedBlock"
  },
  {
    "uid": "Tw9hQyjYp",
    "string": "**Article 371: Special Provisions for Certain States** #linkedBlock\n▪️ To provide special provisions and autonomy to some Indian states for their unique cultural, social, and economic needs.\n▪️ Balanced regional development and protection of local interests.\n\n**State-wise Summary:**\n▪️ Article 371 – Maharashtra and Gujarat: Development boards for backward regions like Vidarbha, Marathwada, Saurashtra, and Kutch.\n▪️ ^^Article 371A – Nagaland^^: Protection of Naga customary law, religion, and land ownership.\n▪️ Article 371B – Assam: Special committee in the Assembly for tribal areas.\n▪️ Article 371C – Manipur: Committee for hill areas and Governor’s responsibility for development.\n▪️ Article 371D – Andhra Pradesh and Telangana: Equal opportunities in education and public employment.\n▪️ Article 371E – Allows establishment of a Central University in Andhra Pradesh.\n▪️ Article 371F – Sikkim: Ensures representation and administrative integration after joining India.\n▪️ Article 371G – Mizoram: Protects Mizo customary law, religion, and land rights.\n▪️ Article 371H – Arunachal Pradesh: Governor has special responsibility for law and order.\n▪️ Article 371I – Goa: Special consideration for development and cultural identity.\n▪️ Article 371J – Karnataka (Hyderabad–Karnataka region): Local reservation in education, jobs, and creation of development boards."
  },
  {
    "uid": "RsLNq86GD",
    "string": "**Divisibiity Rules:** #linkedBlock\n**Rule for 2:**\nA number is divisible by 2 if its last digit is even (0, 2, 4, 6, or 8).\nExample: 246, 358, 102 are divisible by 2.\n\n**Rule for 3:**\nA number is divisible by 3 if the sum of its digits is divisible by 3.\nExample: 123 → 1 + 2 + 3 = 6 (divisible by 3).\n\n**Rule for 4:**\nA number is divisible by 4 if the number formed by its last two digits is divisible by 4.\nExample: 316 → 16 is divisible by 4.\n\n**Rule for 5:**\nA number is divisible by 5 if its last digit is 0 or 5.\nExample: 135, 250 are divisible by 5.\n\n**Rule for 6:**\nA number is divisible by 6 if it is divisible by both 2 and 3.\nExample: 114 → even and 1 + 1 + 4 = 6 (divisible by 3).\n\n**Rule for 8:**\nA number is divisible by 8 if the number formed by its last three digits is divisible by 8.\nExample: 7128 → 128 is divisible by 8.\n\n**Rule for 9:**\nA number is divisible by 9 if the sum of its digits is divisible by 9.\nExample: 729 → 7 + 2 + 9 = 18 (divisible by 9).\n\n**Rule for 10:**\nA number is divisible by 10 if its last digit is 0.\nExample: 120, 450.\n\n**Rule for 11:**\nA number is divisible by 11 if the difference between the sum of digits in odd places and even places is 0 or divisible by 11.\nExample: 121 → (1 + 1) – 2 = 0 (divisible by 11)."
  }
]